doc/overview.org
### -*- mode: org; -*-
#+STARTUP: hidestars #+STARTUP: odd #+STARTUP: logdone #+STARTUP: nofninline
#+STYLE: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: H:7

Overview of desire, a software knowledge and distribution system
#+BEGIN_CENTER
#+BEGIN: block-update-time :format "%B %d, %Y, %H:%M"
January 12, 2010, 08:21
#+END:
#+END_CENTER

* About this document

This document has a canonical location:

	http://www.feelingofgreen.ru/shared/src/desire/doc/overview.html

or, for the Org-mode source:

	http://www.feelingofgreen.ru/shared/src/desire/doc/overview.org

* What is desire (supposed to be)?

Desire is a source code management substrate.  It once was called a
"package management substrate", but no longer, because, while it
does some things a package manager like APT or YUM would do, the actual
packaging part is not represented.

Desire probably is best described as a sum of its current components:
     - a DSL enumerating software module upstreams and facilitating a global
       namespace for described objects, augmented with rich supporting facilities;
     - a nascent VCS management layer[fn:11];
     - a repository format unifier based on the above, facilitating
       redistribution of upstream source code in a common DVCS format;
     - a set of inter-module dependency deducers[fn:10] for various
       situations, but most importantly allowing for automated
       end-user-oriented module retrieval and installation;
     - a number of auxiliary tools based on that substrate:
       - a semi-automated clbuild project definition importer;
       - a fairly automated packager for ASDF-INSTALL;
       - an automated patch applicator providing a set of XCVBified projects;
       - a buildbot with a master/slave architecture and a web interface
         supporting both static and dynamic page generation.

If this sounds like running in all directions, it probably is, as the goal
of desire is to become a substrate supporting all source-code-related
activities -- module enumeration, (re-)distribution, upstream tracking,
release management, packaging, testing etc.

* What can desire do for you /now/?
*** End user

You can use desire in the same manner as ASDF-INSTALL, but in a somewhat more friendly
manner:
     - no non-essential packages need to be installed, because desire has a concept of
       central system of a module[fn:13];
     - you can ask it about available modules in an apropos-like fashion, because of
       the availability of an explicitly declared nomenclature;

Additionally, you can use it to track non-lisp upstreams -- without dependency handling,
for obvious reasons.

*** Upstreams

There are two modes of operation, a participating one and a non-participating one.

The latter requires almost no involvement on upstream's part -- not even use of desire,
whereas the former assumes control over the definition of the corresponding part of the
global upstream namespace.

In either case you get:
     - your modules and their dependencies are globally declared and easily available
       to end-users;
     - buildbot-style testing on http://feelingofgreen.ru/desire-waterfall [fn:12].

***** Non-participating upstreams

You don't have to do anything, but perhaps ask the desire maintainers to record definitions
of modules released by you and of their dependencies, that is, if they are not recorded already.

***** Participating upstreams a.k.a. wishmasters

You get to maintain your portion of global definitions and a set of publicly accessible
git repositories.

In return, you get following things:
     - easy upstream dependency tracking (really, an end-user mode feature);
     - programmatic API for certain aspects of git repository operation;
     - semi-automatic ASDF-INSTALL exporter;
     - possibility to run a local instance of the buildbot.

*** Tinkerer

You know you're in this category when you want to do things like:
     - programmatically generate/maintain/test changes/branches across a set of modules,
       like the automated XCVBifier does, perhaps for facilitating coordinated
       release making;
     - programmatically populate the definition namespace (perhaps for a
       web-sphere where people could register and manipulate their projects);
     - extend the buildbot infrastructure, perhaps adding things like automated
       package generation phase;

I won't go into details at this point, but I believe that desire provides enough
foothold to make all that feasible, if not easy-ish.

Like with any underspecified area, desire employs a degree of heuristics here and there --
and that's where we need specifications to make things predictable and reliable.

* Installation

The ultimate goal of actions described in this section is to provide the user
with a REPL fully prepared for input of desire commands.

*** Requirements

Absolute requirements at this point are a POSIX shell, git and SBCL.

