doc/overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Overview of desire, a software knowledge and distribution system</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-27 15:07:31 MSK"/>
<meta name="author" content="Samium Gromoff"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="style.css" />

</head>
<body>
<div id="content">

<h1 class="title">Overview of desire, a software knowledge and distribution system</h1>


<div style="text-align: center">
<p>January 16, 2010, 19:37
</p>
</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About this document </a></li>
<li><a href="#sec-2">2 What is desire (supposed to be)? </a></li>
<li><a href="#sec-3">3 What can desire do for you <i>now</i>? </a>
<ul>
<li><a href="#sec-3_1">3.1 End user </a></li>
<li><a href="#sec-3_2">3.2 Upstreams </a>
<ul>
<li><a href="#sec-3_2_1">3.2.1 Non-participating upstreams </a></li>
<li><a href="#sec-3_2_2">3.2.2 Participating upstreams a.k.a. wishmasters </a></li>
</ul>
</li>
<li><a href="#sec-3_3">3.3 Tinkerer </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Installation </a>
<ul>
<li><a href="#sec-4_1">4.1 Requirements </a></li>
<li><a href="#sec-4_2">4.2 Bootstrap and initialisation </a>
<ul>
<li><a href="#sec-4_2_1">4.2.1 Manual installation </a></li>
<li><a href="#sec-4_2_2">4.2.2 Semi-automated installation </a></li>
<li><a href="#sec-4_2_3">4.2.3 Fully automated bootstrap </a></li>
<li><a href="#sec-4_2_4">4.2.4 Bootstrap script reference </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Workflows </a>
<ul>
<li><a href="#sec-5_1">5.1 Re-initialisation </a></li>
<li><a href="#sec-5_2">5.2 User aspect </a></li>
<li><a href="#sec-5_3">5.3 Wishmaster aspect </a>
<ul>
<li>
<ul>
<li><a href="#sec-5_3_1">5.3.1 External executables required for module conversion </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5_4">5.4 Extending definitions </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Overview of terms </a>
<ul>
<li><a href="#sec-6_1">6.1 DEFINITIONS </a></li>
<li><a href="#sec-6_2">6.2 Distributors </a>
<ul>
<li><a href="#sec-6_2_1">6.2.1 Wishmasters </a></li>
</ul>
</li>
<li><a href="#sec-6_3">6.3 Locations </a>
<ul>
<li><a href="#sec-6_3_1">6.3.1 Remotes </a>
<ul>
<li><a href="#sec-6_3_1_1">6.3.1.1 Non-gate remotes </a></li>
<li><a href="#sec-6_3_1_2">6.3.1.2 Gate remotes, or gates </a></li>
</ul>
</li>
<li><a href="#sec-6_3_2">6.3.2 Localities </a></li>
<li><a href="#sec-6_3_3">6.3.3 Local gate, or gate locality </a></li>
</ul>
</li>
<li><a href="#sec-6_4">6.4 Modules </a>
<ul>
<li><a href="#sec-6_4_1">6.4.1 Pseudo-modules </a></li>
</ul>
</li>
<li><a href="#sec-6_5">6.5 Systems </a></li>
<li><a href="#sec-6_6">6.6 Applications </a></li>
</ul>
</li>
<li><a href="#sec-7">7 API (aka end-user interface) </a>
<ul>
<li><a href="#sec-7_1">7.1 Initial chores &amp; storage location choice </a></li>
<li><a href="#sec-7_2">7.2 Performing knowledge base queries </a></li>
<li><a href="#sec-7_3">7.3 Making wishes </a>
<ul>
<li><a href="#sec-7_3_1">7.3.1 Reader macros for add-module </a></li>
</ul>
</li>
<li><a href="#sec-7_4">7.4 Less frequently used functions </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Shortcomings </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About this document </h2>
<div class="outline-text-2" id="text-1">


<p>
This document has a canonical location:
</p>
<p>
<a href="http://www.feelingofgreen.ru/shared/src/desire/doc/overview.html">http://www.feelingofgreen.ru/shared/src/desire/doc/overview.html</a>
</p>
<p>
or, for the Org-mode source:
</p>
<p>
<a href="http://www.feelingofgreen.ru/shared/src/desire/doc/overview.org">http://www.feelingofgreen.ru/shared/src/desire/doc/overview.org</a>
</p>
<p>
In case you are looking for a short, take-no-prisoners introduction, you may
consider the crash tutorial:
</p>
<p>
<a href="http://www.feelingofgreen.ru/shared/src/desire/doc/tutorial.html">http://www.feelingofgreen.ru/shared/src/desire/doc/tutorial.html</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What is desire (supposed to be)? </h2>
<div class="outline-text-2" id="text-2">


<p>
Desire is a source code management substrate.  It once was called a
"package management substrate", but no longer, because, while it
does some things a package manager like APT or YUM would do, the actual
packaging part is not represented.
</p>
<p>
Desire probably is best described as a sum of its current components:
</p><ul>
<li>
a DSL enumerating software module upstreams and facilitating a global
namespace for described objects, augmented with rich supporting facilities;
</li>
<li>
a nascent VCS management layer<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>;
</li>
<li>
a repository format unifier based on the above, facilitating
redistribution of upstream source code in a common DVCS format;
</li>
<li>
a set of inter-module dependency deducers<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup> for various
situations, but most importantly allowing for automated
end-user-oriented module retrieval and installation;
</li>
<li>
a number of auxiliary tools based on that substrate:
<ul>
<li>
a semi-automated clbuild project definition importer;
</li>
<li>
a fairly automated packager for ASDF-INSTALL;
</li>
<li>
an automated patch applicator providing a set of XCVBified projects;
</li>
<li>
a buildbot with a master/slave architecture and a web interface
supporting both static and dynamic page generation.
</li>
</ul>
</li>
</ul>


<p>
If this sounds like running in all directions, it probably is, as the goal
of desire is to become a substrate supporting all source-code-related
activities &ndash; module enumeration, (re-)distribution, upstream tracking,
release management, packaging, testing etc.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What can desire do for you <i>now</i>? </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> End user </h3>
<div class="outline-text-3" id="text-3_1">


<p>
You can use desire in the same manner as ASDF-INSTALL, but in a somewhat more friendly
manner:
</p><ul>
<li>
no non-essential packages need to be installed, because desire has a concept of
central system of a module<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>;
</li>
<li>
you can ask it about available modules in an apropos-like fashion, because of
the availability of an explicitly declared nomenclature;
</li>
</ul>


<p>
Additionally, you can use it to track non-lisp upstreams &ndash; without dependency handling,
for obvious reasons.
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Upstreams </h3>
<div class="outline-text-3" id="text-3_2">


<p>
There are two modes of operation, a participating one and a non-participating one.
</p>
<p>
The latter requires almost no involvement on upstream's part &ndash; not even use of desire,
whereas the former assumes control over the definition of the corresponding part of the
global upstream namespace.
</p>
<p>
In either case you get:
</p><ul>
<li>
your modules and their dependencies are globally declared and easily available
to end-users;
</li>
<li>
buildbot-style testing on <a href="http://feelingofgreen.ru/desire-waterfall">http://feelingofgreen.ru/desire-waterfall</a> <sup><a class="footref" name="fnr.4" href="#fn.4">4</a></sup>.
</li>
</ul>



</div>

<div id="outline-container-3_2_1" class="outline-4">
<h4 id="sec-3_2_1"><span class="section-number-4">3.2.1</span> Non-participating upstreams </h4>
<div class="outline-text-4" id="text-3_2_1">


<p>
You don't have to do anything, but perhaps ask the desire maintainers to record definitions
of modules released by you and of their dependencies, that is, if they are not recorded already.
</p>
</div>

</div>

<div id="outline-container-3_2_2" class="outline-4">
<h4 id="sec-3_2_2"><span class="section-number-4">3.2.2</span> Participating upstreams a.k.a. wishmasters </h4>
<div class="outline-text-4" id="text-3_2_2">


<p>
You get to maintain your portion of global definitions and a set of publicly accessible
git repositories.
</p>
<p>
In return, you get following things:
</p><ul>
<li>
easy upstream dependency tracking (really, an end-user mode feature);
</li>
<li>
programmatic API for certain aspects of git repository operation;
</li>
<li>
semi-automatic ASDF-INSTALL exporter;
</li>
<li>
possibility to run a local instance of the buildbot.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> Tinkerer </h3>
<div class="outline-text-3" id="text-3_3">


<p>
You know you're in this category when you want to do things like:
</p><ul>
<li>
programmatically generate/maintain/test changes/branches across a set of modules,
like the automated XCVBifier does, perhaps for facilitating coordinated
release making;
</li>
<li>
programmatically populate the definition namespace (perhaps for a
web-sphere where people could register and manipulate their projects);
</li>
<li>
extend the buildbot infrastructure, perhaps adding things like automated
package generation phase;
</li>
</ul>


<p>
I won't go into details at this point, but I believe that desire provides enough
foothold to make all that feasible, if not easy-ish.
</p>
<p>
Like with any underspecified area, desire employs a degree of heuristics here and there --
and that's where we need specifications to make things predictable and reliable.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installation </h2>
<div class="outline-text-2" id="text-4">


<p>
The ultimate goal of actions described in this section is to provide the user
with a REPL fully prepared for input of desire commands.
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Requirements </h3>
<div class="outline-text-3" id="text-4_1">


<p>
Absolute requirements at this point are a POSIX shell, git and SBCL.
</p>
</div>

</div>
