doc/overview.org
*** Bootstrap and initialisation

Besides the obvious download and compilation/load steps, desire requires
an initialisation procedure parametrised with a source code storage area,
in order to become operational.

All these steps can be carried out:
     - manually;
     - in a semi-automated manner, with assist of ASDF-INSTALL;
     - in a completely automated manner, using the bootstrap script.

Before we proceed, a crucial concept of the storage area must be discussed.

The storage area is a writable directory whose writable subdirectories
fall into one of the three categories:
     - module repositories maintained by desire through git;
     - /foreign/ VCS subroots containing transitory repositories in
       foreign formats;
     - metadata repositories used for desire's internode communication
       and information tracking.

For the time being, the system-wide policy for maintenance of these
storage roots is not devised yet, so they are effectively per-user.

Unless you go the fully-automated bootstrap way, the first time you run
desire you will need to prepare an empty writeable directory.

***** Manual installation

	: root="/absolute/path/to/storage-area/"

The remaining of the shell snippet is designed to be pastable into a shell:

#+BEGIN_EXAMPLE
	mkdir ${root}
	cd ${root}
	dependencies="alexandria asdf cl-fad desire executor pergamum iterate"
	for dep in ${dependencies}
	do
		git clone -o git.feelingofgreen.ru git://git.feelingofgreen.ru/$dep
		# alternative for behind-HTTP-proxy world:
		# git clone -o git.feelingofgreen.ru http://git.feelingofgreen.ru/shared/src/$dep/.git/
		ln -s ${root}/$dep/$dep.asd
	done
	sbcl --no-userinit --no-sysinit --eval '(load (compile-file "asdf/asdf.lisp"))' \
	     --eval "(require :desire)" \
	     --eval "(desire:init \"${root}\")" \
	     --eval "(in-package :desire)"
#+END_EXAMPLE
     
***** Semi-automated installation

This mode is intended to use ASDF-INSTALL, but alas it doesn't work,
as you need to be in SBCL without ASDF loaded, because desire depends on a
development version of ASDF which is not yet integrated into SBCL.

***** Fully automated bootstrap

Desire includes a booststrap script which is located at:

	http://www.feelingofgreen.ru/shared/src/desire/climb.sh

Download that script and run it like that (the trailing slash is important):

	: sh climb.sh /absolute/path/to/storage-root/

The reference for various controls follows.

***** Bootstrap script reference

This script performs following operations:

     -  use git to download modules desire depends on, placing them
        in the provided storage location;
     -  load and perform an initial setup of desire;
     -  optionally install a desired module and its dependencies;
     -  optionally evaluate an expression in the resulting environment.

Invoke it like this:

#+BEGIN_EXAMPLE
  climb.sh [OPTION]... [STORAGE-ROOT]
Bootstrap, update or perform other actions on a desire installation
in either STORAGE-ROOT, or a location specified in ~/.climb-root

  -u          Self-update and continue processing other options, using
                the updated version.
  -n HOSTNAME Use HOSTNAME as a bootstrap node.
                HOSTNAME must refer to a node participating in desire protocol.
  -b BRANCH   Check out BRANCH of desire other than 'master'.
  -t BRANCH   Check out BRANCH of metastore on the bootstrap node other than
                the default.  The default is the same as the used branch
                of desire.
  -m MODULE   Retrieve MODULE, once ready.
  -s SYSTEM   Install or update the module relevant to SYSTEM, then load it.
  -a APP      Load system containing APP, as per -s, then launch it.
  -x EXPR     Evaluate an expression, in the end of it all.
  -d          Enable debug optimisation of Lisp code.
  -n          Disable debugger, causing desire dump stack and abort on errors,
                instead of entering the debugger.
  -e          Enable explanations about external program invocations.
  -v          Crank up verbosity.
  -V          Print version.
  -h          Display a help message.
#+END_EXAMPLE

As step zero, when the -u switch is provided, climb.sh is updated using wget
from the canonical location at http://www.feelingofgreen.ru/shared/src/desire/climb.sh,
and then normal processing is continued, using the updated version.

During the first step, a storage root location is either created or validated.
The pre-existing storage root must be a writable directory containing a
writable 'git' subdirectory.

When STORAGE-ROOT is not specified, ~/.climb-root is looked up for an
absolute pathname referring to a valid storage location.  If this condition
is met, that directory is accepted as STORAGE-ROOT, otherwise an error
is signalled.

When STORAGE-ROOT is specified, it must be either an absolute pathname
referring to a valid storage location, or it must denote a non-occupied
filesystem location, with a writable parent directory.

During the second step, desire and its dependencies are either retrieved,
or updated, in the case when they are already present in STORAGE-ROOT.

Next, a specific branch of desire is checked out, configurable with the
-d option and defaulting to "master".

Further, the -n and -t options alter, correspondingly, the hostname
of the desire node used for bootstrap, and a branch of that node's metastore
to use.  These options default to git.feelingofgreen.ru and
the name of the branch of desire, accordingly.

During the next step a lisp is started and desire initialisation is attempted,
with the above determined values of hostname and metastore branch.

Once the initialisation is complete, MODULE, SYSTEM and APP provide
optional convenience shortcuts for module installation, system loading
and application launching.  Any of these can be omitted, as the required
information is easily deduced.  Note that the more granular objects
determine the objects of lower granularity.

After all these steps, EXPR is executed, if it was provided.

* Workflows

This section assumes that desire was already made operational by either
means described in the previous chapter.

