doc/overview.org
*** Re-initialisation

The INIT procedure ensures that repositories constituting your desire node
are in working order.
    
Depending on whether you run a well-known desire node (that is, a wishmaster)
you need to provide the :AS keyword to INIT:

	: (init "/path/to/root/")                            ; for non-well-known mode
or:
	: (init "/path/to/root/" :as 'your-node-domain-name) ; for wishmaster mode

The specified root directory will contain all VCS-specific master localities,
as well as anything module's post-install scripts choose to deliver.
This pathname is available in =*SELF*=, using the ROOT reader.

Unless you already have a '.meta' module, an initial seed version will be
downloaded for you.  Currently the wishmaster chosen for this is
git.feelingofgreen.ru.

This procedure also determines the available VCS tools, as well as conversion
tools, and determines the set of accessible remotes.

Further, it scans the git locality for known modules, and makes their systems
registered in the ASDF registry.

*** User aspect

Unless you happen to have some conversion tools, the set of modules available
to your node is restricted to those available via git remotes.

The LUST function serves to either initially download or update a set of defined
modules.

APROPOS-DESR and LIST-MODULES provide convenient knowledge base query
facilities. For a wider set of functions, please see section 3.

*** Wishmaster aspect

From the wishmaster point of view the INIT function also does:

     -  checks that the locally available set of modules covers every module
        that is claimed to be "well known" to be published by our
        distributor[fn:7], otherwise signalling an error
     -  publishes the informations about non-released, converted modules
        in the gate remote's DEFINITIONS file

******* External executables required for module conversion
        
The conversion is performed by external programs:

     -  darcs-to-git[fn:8]
     -  git cvs, debian package git-cvs
     -  git svn, debian package git-svn

*** Extending definitions

ADD-MODULE and the accompanying reader macro #@"u://r.l/" is a one-stop
point useful for manual extension of the set of known entities.  The URI
type of the URL must name to the VCS used at the given distribution point,
that is one of 'git', 'http' (which actually means git+http), 'darcs',
'cvs' or 'svn'.

The required super-entities are either found among current definitions,
or created on the spot.

SAVE-DEFINITIONS writes out changes into
<value-of-(ROOT =*SELF*=)>/git/.meta/DEFINITIONS

* Overview of terms
*** DEFINITIONS

This is the term you will often see mentioned, as it is central to
the process of distribution of information about the domain.

For the moment it would suffice to say that this is a text file
containing forms (which are READable using desire-provided readers) which
carry information about terms covered in this section.

*** Distributors

The largest unit of software granularity is a /distributor/, which
corresponds to an internet domain name[fn:1].  Currently, they don't carry
much information beyond just that.

Distributors contain one or more /remotes/, which correspond to points
of distribution of sets of similarly-accessible modules.

***** Wishmasters

/Wishmaster/ is a subtype of distributor which participates in the
desire network, in the form of being recorded in /DEFINITIONS/, as well as
by maintaining a /gate/ (a subtype of remotes upon which we will elaborate
further below).  When applied to /wishmasters/, the virtue of being
registered in /some/ DEFINITIONS is otherwise referred to as property
of being /well-known/.

Two important processes naturally growing out of this are:
    - exchange of DEFINITIONS, be it among well-known wishmasters, or
      as a process of informing a client node, and
    - upstream module conversion, which ends up populating the /gate/;

The upstream module conversion process serves to simplify life of average
desire users by repackaging modules available through a variety
of distribution means[fn:2] into a common DVCS format.

The wishmaster corresponding to the local desire instance is available
through the variable called =*SELF*=.

*** Locations

/Location/ is a general term for objects storing /module/ repositories,
and are either local, in which case they are /localities/, or non-local,
in which case they are, unsurprisingly, /remotes/[fn:3].

***** Remotes

The concept of /remote/ serves as a point of distribution for a group of /modules/.

In general, all remotes carry the following information:
     - version control system type (git, darcs, cvs or svn),
     - transport type (native, http or rsync),
     - simple pattern for matching module paths on the distributor,
     - an internet port number, and
     - some additional quirks necessary to access the remote repository;

******* Non-gate remotes

/Non-gate remotes/ represent distribution points of non-wishmasters, that is,
nodes not participating in the desire protocol.

******* Gate remotes, or gates

/Gate remotes/, or /gates/ are special remotes which are instrumental
to participation in the desire protocol.  They carry a special module called
*.meta*, which records the containing distributor's idea about the domain
in aforementioned DEFINITIONS.

The information in this file is subject to propagation in the network
of hosts participating in the desire protocol.

Gate remotes have a second purpose: as parts of well-known wishmasters
they serve for redistribution of modules converted by those wishmasters
into a single repository format, currently /git/.  The modules converted
in such a way are advertised differently from those which are considered
'released' by the containing distributor.

