doc/overview.html

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> Re-initialisation </h3>
<div class="outline-text-3" id="text-5_1">


<p>
The INIT procedure ensures that repositories constituting your desire node
are in working order.
</p>
<p>
Depending on whether you run a well-known desire node (that is, a wishmaster)
you need to provide the :AS keyword to INIT:
</p>
<pre class="example">
(init "/path/to/root/")                            ; for non-well-known mode
</pre>

<p>or:
</p><pre class="example">
(init "/path/to/root/" :as 'your-node-domain-name) ; for wishmaster mode
</pre>


<p>
The specified root directory will contain all VCS-specific master localities,
as well as anything module's post-install scripts choose to deliver.
This pathname is available in <code>*SELF*</code>, using the ROOT reader.
</p>
<p>
Unless you already have a '.meta' module, an initial seed version will be
downloaded for you.  Currently the wishmaster chosen for this is
git.feelingofgreen.ru.
</p>
<p>
This procedure also determines the available VCS tools, as well as conversion
tools, and determines the set of accessible remotes.
</p>
<p>
Further, it scans the git locality for known modules, and makes their systems
registered in the ASDF registry.
</p>
</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> User aspect </h3>
<div class="outline-text-3" id="text-5_2">


<p>
Unless you happen to have some conversion tools, the set of modules available
to your node is restricted to those available via git remotes.
</p>
<p>
The DESIRE function serves to either initially download or update a set of defined
modules.
</p>
<p>
APROPOS-DESR and LIST-MODULES provide convenient knowledge base query
facilities. For a wider set of functions, please see section 3.
</p>
</div>

</div>

<div id="outline-container-5_3" class="outline-3">
<h3 id="sec-5_3"><span class="section-number-3">5.3</span> Wishmaster aspect </h3>
<div class="outline-text-3" id="text-5_3">


<p>
From the wishmaster point of view the INIT function also does:
</p>
<ul>
<li>
 checks that the locally available set of modules covers every module
that is claimed to be "well known" to be published by our
distributor<sup><a class="footref" name="fnr.5" href="#fn.5">5</a></sup>, otherwise signalling an error
</li>
<li>
 publishes the informations about non-released, converted modules
in the gate remote's DEFINITIONS file
</li>
</ul>



</div>

<div id="outline-container-5_3_1" class="outline-5">
<h5 id="sec-5_3_1"><span class="section-number-5">5.3.1</span> External executables required for module conversion </h5>
<div class="outline-text-5" id="text-5_3_1">


<p>
The conversion is performed by external programs:
</p>
<ul>
<li>
 darcs-to-git<sup><a class="footref" name="fnr.6" href="#fn.6">6</a></sup>
</li>
<li>
 git cvs, debian package git-cvs
</li>
<li>
 git svn, debian package git-svn
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5_4" class="outline-3">
<h3 id="sec-5_4"><span class="section-number-3">5.4</span> Extending definitions </h3>
<div class="outline-text-3" id="text-5_4">


<p>
ADD-MODULE and the accompanying reader macro #@"u://r.l/" is a one-stop
point useful for manual extension of the set of known entities.  The URI
type of the URL must name to the VCS used at the given distribution point,
that is one of 'git', 'http' (which actually means git+http), 'darcs',
'cvs' or 'svn'.
</p>
<p>
The required super-entities are either found among current definitions,
or created on the spot.
</p>
<p>
SAVE-DEFINITIONS writes out changes into
&lt;value-of-(ROOT <code>*SELF*</code>)&gt;/git/.meta/DEFINITIONS
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Overview of terms </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> DEFINITIONS </h3>
<div class="outline-text-3" id="text-6_1">


<p>
This is the term you will often see mentioned, as it is central to
the process of distribution of information about the domain.
</p>
<p>
For the moment it would suffice to say that this is a text file
containing forms (which are READable using desire-provided readers) which
carry information about terms covered in this section.
</p>
</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> Distributors </h3>
<div class="outline-text-3" id="text-6_2">


<p>
The largest unit of software granularity is a <i>distributor</i>, which
corresponds to an internet domain name<sup><a class="footref" name="fnr.7" href="#fn.7">7</a></sup>.  Currently, they don't carry
much information beyond just that.
</p>
<p>
Distributors contain one or more <i>remotes</i>, which correspond to points
of distribution of sets of similarly-accessible modules.
</p>

</div>

<div id="outline-container-6_2_1" class="outline-4">
<h4 id="sec-6_2_1"><span class="section-number-4">6.2.1</span> Wishmasters </h4>
<div class="outline-text-4" id="text-6_2_1">


<p>
<i>Wishmaster</i> is a subtype of distributor which participates in the
desire network, in the form of being recorded in <i>DEFINITIONS</i>, as well as
by maintaining a <i>gate</i> (a subtype of remotes upon which we will elaborate
further below).  When applied to <i>wishmasters</i>, the virtue of being
registered in <i>some</i> DEFINITIONS is otherwise referred to as property
of being <i>well-known</i>.
</p>
<p>
Two important processes naturally growing out of this are:
</p><ul>
<li>
exchange of DEFINITIONS, be it among well-known wishmasters, or
as a process of informing a client node, and
</li>
<li>
upstream module conversion, which ends up populating the <i>gate</i>;
</li>
</ul>


<p>
The upstream module conversion process serves to simplify life of average
desire users by repackaging modules available through a variety
of distribution means<sup><a class="footref" name="fnr.8" href="#fn.8">8</a></sup> into a common DVCS format.
</p>
<p>
The wishmaster corresponding to the local desire instance is available
through the variable called <code>*SELF*</code>.
</p>
</div>
</div>

</div>

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> Locations </h3>
<div class="outline-text-3" id="text-6_3">


<p>
<i>Location</i> is a general term for objects storing <i>module</i> repositories,
and are either local, in which case they are <i>localities</i>, or non-local,
in which case they are, unsurprisingly, /remotes/<sup><a class="footref" name="fnr.9" href="#fn.9">9</a></sup>.
</p>

</div>

<div id="outline-container-6_3_1" class="outline-4">
<h4 id="sec-6_3_1"><span class="section-number-4">6.3.1</span> Remotes </h4>
<div class="outline-text-4" id="text-6_3_1">


<p>
The concept of <i>remote</i> serves as a point of distribution for a group of <i>modules</i>.
</p>
<p>
In general, all remotes carry the following information:
</p><ul>
<li>
version control system type (git, darcs, cvs or svn),
</li>
<li>
transport type (native, http or rsync),
</li>
<li>
simple pattern for matching module paths on the distributor,
</li>
<li>
an internet port number, and
</li>
<li>
some additional quirks necessary to access the remote repository;
</li>
</ul>



</div>

<div id="outline-container-6_3_1_1" class="outline-5">
<h5 id="sec-6_3_1_1"><span class="section-number-5">6.3.1.1</span> Non-gate remotes </h5>
<div class="outline-text-5" id="text-6_3_1_1">


<p>
<i>Non-gate remotes</i> represent distribution points of non-wishmasters, that is,
nodes not participating in the desire protocol.
</p>
</div>

</div>

<div id="outline-container-6_3_1_2" class="outline-5">
<h5 id="sec-6_3_1_2"><span class="section-number-5">6.3.1.2</span> Gate remotes, or gates </h5>
<div class="outline-text-5" id="text-6_3_1_2">


<p>
<i>Gate remotes</i>, or <i>gates</i> are special remotes which are instrumental
to participation in the desire protocol.  They carry a special module called
<b>.meta</b>, which records the containing distributor's idea about the domain
in aforementioned DEFINITIONS.
</p>
<p>
The information in this file is subject to propagation in the network
of hosts participating in the desire protocol.
</p>
<p>
Gate remotes have a second purpose: as parts of well-known wishmasters
they serve for redistribution of modules converted by those wishmasters
into a single repository format, currently <i>git</i>.  The modules converted
in such a way are advertised differently from those which are considered
'released' by the containing distributor.
</p>
</div>
</div>

</div>
