doc/overview.org
***** Localities

/Localities/ serve to express module storage on the local machine.
/Master localities/ (except the /local gate/, about which see below)
are canonical transitory locations used for conversion of modules
retrieved from remotes of specific VCS types.

/The master git locality/, also the /local gate/ or a /gate locality/, is
described in the next section, and is supposed to be a canonical storage
location for all modules used on the desire node.

A scrupulous reader might note that the above description leaves open
a possibility of existence for /non-master localities/.  While it is true,
and purposefully so, this concept is not currently employed.

***** Local gate, or gate locality

=*SELF*= always contains a special location, a /local gate/ or a /gate locality/,
which is both a remote and a locality and serves a threefold purpose:

   - storage of incoming modules for local consumption,
   - export of the aforementioned converted modules, and
   - distribution point for modules released by the local distributor.

Naturally, the last two points only apply to well-known wishmasters.

*** Modules

/Modules/ represent versioned, atomic units of software, as released
by the distributor, and, from the point of desire, carry the additional
information necessary to complete the information provided by
the less granular concepts to obtain the module from its containing remote.

Modules can be provided by several different remotes of different
distributors.  When the end-user requests retrieval of a module, gate remotes
are preferred above others.

Locally, all incoming modules end up in the local gate, which
always exists, nevermind the dominant operation mode of the desire node.
Once in the local gate, the module becomes /locally available/[fn:9], and is
made loadable through the preferred local system definition facility.

Locally available modules can be classified into one of the four
categories, the first two of which are only applicable to well-known
wishmasters:

   - released, for modules advertised through DEFINITIONS to be released
     through the distributor corresponding to =*SELF*=;
   - converted, for module originating elsewhere, but advertised in
     DEFINITIONS as being converted in the gate of =*SELF*=;
   - unpublished, modules accessible through the gate, yet unadvertised
     in DEFINITIONS;
   - hidden, modules physically present in the local gate, but made
     unavailable to anonymous remote clients[fn:4].

***** Pseudo-modules

/Pseudo-modules/ refer to repositories stored in gates used for desire-specific
information storage and exchange.  Currently there are two common pseudo-modules:

   - *.meta*, the aforementioned domain-specific information junction point, and
   - *.local-meta*, a hidden repository used to store local information, which
     currently amounts to tracking unpublished and hidden modules.

*** Systems

Descending further down we meet /systems/.
Systems are objects only meant to be relevant in the domain of Common Lisp
software, and more precisely -- to backend system definition facilities,
such as ASDF, XCVB, Mudballs or others[fn:5].

The concept of system introduces inter-system dependencies, which cross
module boundaries, producing inter-module dependencies.

Evidently, there can be several systems per module, and also those can be
obscured from the end-user, either intentionally or by unfortunate
accident[fn:6].

Desire handles all these complications and operates on the full
inter-module dependency graph.  It also doesn't store that graph anywhere,
recomputing it, instead, every time a request for a module is performed.

It should be noted, that there is no requirement for modules to have systems,
which enables end-users to manage (and provide) gittified non-Lisp software
for local (and not-so-local) needs.

*** Applications

Applications are simple extensions of systems, providing some very
preliminary support for launching programs.  They are intended to simplify
end-user experience by making requests such as "run climacs" expressible
and actionable.

* API (aka end-user interface)
*** Initial chores & storage location choice

      - init path &key as (default-wishmasters (list desr:*default-wishmaster*)) => <no values> ::
        Initialise desire with PATH chosen as directory for storage of all VCS-specific locations.
       
        When AS is non-NIL an attempt is made to establish an identity to a defined distributor
        named by the AS keyword.

        This is performed by checking that the locally available set of modules covers every module
        that is claimed to be to be published by our distributor[fn:7], according to the local
        DEFINITIONS.  When this check fails an error is signalled.

      - =*self*= => distributor ::
        The local distributor set up during INIT, be it well-known or not.

      - root local-distributor => pathname ::
        The root directory containing all VCS-specific locations of LOCAL-DISTRIBUTOR, chosen during INIT-time.

