doc/overview.html

<div id="outline-container-6_3_2" class="outline-4">
<h4 id="sec-6_3_2"><span class="section-number-4">6.3.2</span> Localities </h4>
<div class="outline-text-4" id="text-6_3_2">


<p>
<i>Localities</i> serve to express module storage on the local machine.
<i>Master localities</i> (except the <i>local gate</i>, about which see below)
are canonical transitory locations used for conversion of modules
retrieved from remotes of specific VCS types.
</p>
<p>
<i>The master git locality</i>, also the <i>local gate</i> or a <i>gate locality</i>, is
described in the next section, and is supposed to be a canonical storage
location for all modules used on the desire node.
</p>
<p>
A scrupulous reader might note that the above description leaves open
a possibility of existence for <i>non-master localities</i>.  While it is true,
and purposefully so, this concept is not currently employed.
</p>
</div>

</div>

<div id="outline-container-6_3_3" class="outline-4">
<h4 id="sec-6_3_3"><span class="section-number-4">6.3.3</span> Local gate, or gate locality </h4>
<div class="outline-text-4" id="text-6_3_3">


<p>
<code>*SELF*</code> always contains a special location, a <i>local gate</i> or a <i>gate locality</i>,
which is both a remote and a locality and serves a threefold purpose:
</p>
<ul>
<li>
storage of incoming modules for local consumption,
</li>
<li>
export of the aforementioned converted modules, and
</li>
<li>
distribution point for modules released by the local distributor.
</li>
</ul>


<p>
Naturally, the last two points only apply to well-known wishmasters.
</p>
</div>
</div>

</div>

<div id="outline-container-6_4" class="outline-3">
<h3 id="sec-6_4"><span class="section-number-3">6.4</span> Modules </h3>
<div class="outline-text-3" id="text-6_4">


<p>
<i>Modules</i> represent versioned, atomic units of software, as released
by the distributor, and, from the point of desire, carry the additional
information necessary to complete the information provided by
the less granular concepts to obtain the module from its containing remote.
</p>
<p>
Modules can be provided by several different remotes of different
distributors.  When the end-user requests retrieval of a module, gate remotes
are preferred above others.
</p>
<p>
Locally, all incoming modules end up in the local gate, which
always exists, nevermind the dominant operation mode of the desire node.
Once in the local gate, the module becomes /locally available/<sup><a class="footref" name="fnr.10" href="#fn.10">10</a></sup>, and is
made loadable through the preferred local system definition facility.
</p>
<p>
Locally available modules can be classified into one of the four
categories, the first two of which are only applicable to well-known
wishmasters:
</p>
<ul>
<li>
released, for modules advertised through DEFINITIONS to be released
through the distributor corresponding to <code>*SELF*</code>;
</li>
<li>
converted, for module originating elsewhere, but advertised in
DEFINITIONS as being converted in the gate of <code>*SELF*</code>;
</li>
<li>
unpublished, modules accessible through the gate, yet unadvertised
in DEFINITIONS;
</li>
<li>
hidden, modules physically present in the local gate, but made
unavailable to anonymous remote clients<sup><a class="footref" name="fnr.11" href="#fn.11">11</a></sup>.
</li>
</ul>



</div>

<div id="outline-container-6_4_1" class="outline-4">
<h4 id="sec-6_4_1"><span class="section-number-4">6.4.1</span> Pseudo-modules </h4>
<div class="outline-text-4" id="text-6_4_1">


<p>
<i>Pseudo-modules</i> refer to repositories stored in gates used for desire-specific
information storage and exchange.  Currently there are two common pseudo-modules:
</p>
<ul>
<li>
<b>.meta</b>, the aforementioned domain-specific information junction point, and
</li>
<li>
<b>.local-meta</b>, a hidden repository used to store local information, which
currently amounts to tracking unpublished and hidden modules.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6_5" class="outline-3">
<h3 id="sec-6_5"><span class="section-number-3">6.5</span> Systems </h3>
<div class="outline-text-3" id="text-6_5">


<p>
Descending further down we meet <i>systems</i>.
Systems are objects only meant to be relevant in the domain of Common Lisp
software, and more precisely &ndash; to backend system definition facilities,
such as ASDF, XCVB, Mudballs or others<sup><a class="footref" name="fnr.12" href="#fn.12">12</a></sup>.
</p>
<p>
The concept of system introduces inter-system dependencies, which cross
module boundaries, producing inter-module dependencies.
</p>
<p>
Evidently, there can be several systems per module, and also those can be
obscured from the end-user, either intentionally or by unfortunate
accident<sup><a class="footref" name="fnr.13" href="#fn.13">13</a></sup>.
</p>
<p>
Desire handles all these complications and operates on the full
inter-module dependency graph.  It also doesn't store that graph anywhere,
recomputing it, instead, every time a request for a module is performed.
</p>
<p>
It should be noted, that there is no requirement for modules to have systems,
which enables end-users to manage (and provide) gittified non-Lisp software
for local (and not-so-local) needs.
</p>
</div>

</div>

<div id="outline-container-6_6" class="outline-3">
<h3 id="sec-6_6"><span class="section-number-3">6.6</span> Applications </h3>
<div class="outline-text-3" id="text-6_6">


<p>
Applications are simple extensions of systems, providing some very
preliminary support for launching programs.  They are intended to simplify
end-user experience by making requests such as "run climacs" expressible
and actionable.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> API (aka end-user interface) </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Initial chores &amp; storage location choice </h3>
<div class="outline-text-3" id="text-7_1">


<dl>
<dt>init path &amp;key as (default-wishmasters (list desr:*default-wishmaster*)) =&gt; &lt;no values&gt;</dt><dd>

<p>
Initialise desire with PATH chosen as directory for storage of all VCS-specific locations.
</p>
<p>
When AS is non-NIL an attempt is made to establish an identity to a defined distributor
named by the AS keyword.
</p>
<p>
This is performed by checking that the locally available set of modules covers every module
that is claimed to be to be published by our distributor<sup><a class="footref" name="fnr.5.2" href="#fn.5">5</a></sup>, according to the local
DEFINITIONS.  When this check fails an error is signalled.
</p>
</dd>
<dt><code>*self*</code> =&gt; distributor</dt><dd>

<p>
The local distributor set up during INIT, be it well-known or not.
</p>
</dd>
<dt>root local-distributor =&gt; pathname</dt><dd>

<p>
The root directory containing all VCS-specific locations of LOCAL-DISTRIBUTOR, chosen during INIT-time.
</p></dd>
</dl>


</div>

</div>
