doc/overview.org
*** Performing knowledge base queries
      - distributor name &key (if-does-not-exist :error) => distributor ::
      - remote name &key (if-does-not-exist :error) => remote ::
      - module name &key (if-does-not-exist :error) => module ::
      - system name &key (if-does-not-exist :error) => system ::
      - app name &key (if-does-not-exist :error) => app ::
      - locality name &key (if-does-not-exist :error) => locality ::
        Find objects by name.

      - name object => symbol ::
        Yield object's name.

      - url remote-designator &optional module-specifier => string ::
        Compute the URL of a module designated by MODULE-SPECIFIER contained a remote designated by
        REMOTE-DESIGNATOR.

      - apropos-desr string-designator &optional set-designator => <no values> ::
        Like APROPOS, but finds objects from the domain of desire.

      - apropos-desr-list string-designator &optional set-designator => desirables ::
        Like APROPOS-LIST, but finds objects from the domain of desire.

      - list-modules => <no values> ::
        List all known modules, with some additional information.

      - module-hidden-p module-designator &optional (locality (gate =*self*=)) => boolean ::
        See whether whether module designated by MODULE-DESIGNATOR is unavailable to anonymous remote clients.

      - module-present-p module-designator &optional (locality (gate =*self*=)) check-when-present-p (check-when-missing-p t) => boolean ::
        Determine whether module designated by MODULE-DESIGNATOR is present in LOCALITY, which defaults
        to the local gate locality.

      - local-summary &optional (stream =*standard-output*=) => <no values> ::
        Print a summary about modules within the local gate to STREAM.
        
      - module-best-remote module-designator &key (if-does-not-exist :error) => remote ::
        Produce the remote, if any, which will be chosen to satisfy desires for module
        designated by MODULE-DESIGNATOR.

      - module-best-distributor module-designator &key (if-does-not-exist :error) => remote ::
        Produce the distributor, if any, whose remote will be chosen to satisfy desires
        for module designated by MODULE-DESIGNATOR.

      - module-fetch-url module &key allow-self => string ::
        Return the URL which is to be used while fetching MODULE, that is the location of MODULE in the preferred remote.
        When ALLOW-SELF is specified, and non-NIL, remotes within =*SELF*= are not discarded from consideration.

      - touch-module module => boolean, string ::
        Try 'access' MODULE via its preferred remote and return whether the attempt was successful as the primary value,
        and the output of the toucher executable as the secondary value.

      - system-loadable-p system-designator &optional (locality (gate =*self*=)) => generalised-boolean ::
        Determine whether system designated by SYSTEM-DESIGNATOR is loadable in LOCALITY, which defaults
        to the local gate locality.

*** Making wishes

      - lust &rest module-names => boolean ::
        Make modules with MODULE-NAMES locally available.

      - add-module url &key module-name systemlessp (system-type desr:*default-system-type*) (lust desr:*auto-lust*) => module ::
        Define a new module, with download location specified by URL, and the module's name
        either deduced from the URL, or provided via MODULE-NAME.

        When LUST is non-NIL, the module is fetched after its definition is internalised.

      - update module-designator &optional (locality (gate *self*)) => <no values> ::
        Update a module specified by MODULE-DESIGNATOR, possibly specifying the target LOCALITY.

      - make-module-unpublished module-designator &optional (locality (gate =*self*=)) ::
        Stop advertising MODULE in DEFINITIONS, without completely hiding it.
        If it is hidden, unhide it.
      
      - hide-module module-designator &optional (locality (gate =*self*=)) ::
        Stop advertising MODULE in DEFINITIONS, as well as make it inaccessible
        to general public through LOCALITY.

      - =*auto-lust*= => boolean ::
        Whether to automatically LUST the modules during ADD-MODULE.  Defaults to NIL.

      - =*fetch-errors-serious*= => boolean ::
        Whether to raise an error when external executables fail to fetch modules during LUST, DESIRE or UPDATE.
        Defaults to NIL.

      - =*follow-upstream*= => boolean ::
        Whether tracking upstream should update HEAD.
        Defaults to T.

      - =*dirty-repository-behaviour*= => keyword ::
        Whenever a dirty repository comes up in a situation which requires
        a clean one to proceed, do accordingly to the value of this variable:
        - :RESET  -  reset the dirty repository, losing unsaved changes,
        - :STASH  -  reset the dirty repository, stashing unsaved changes,
        - :ERROR  -  raise an error.
        Defaults to :RESET.

***** Reader macros for add-module

Following reader macro is enabled by install-add-module-reader:

: #@"u://r.l"
: #@("u://r.l" &optional module-name &key (lust *auto-lust*))

*** Less frequently used functions

      - system-definition system repository-path &key (if-does-not-exist :error) => pathname ::
        Return the pathname of the SYSTEM's definition.
       
      - clear-definitions => <no values> ::
        Forget everything. A subsequent READ-DEFINITIONS will be instrumental to continue any productive use.

      - remove-remote remote-designator &key keep-modules => nil ::
        Forget everything associated with a remote specified by REMOTE-DESIGNATOR, optionally, when KEEP-MODULES
        is non-NIL, keeping modules referred by it.

      - remove-module module-designator &key keep-localities => nil ::
        Forget everything associated with module specified by MODULE-DESIGNATOR, including
        its systems and applications.

      - remove-system system-designator => nil ::
        Forget everything associated with the system specified by SYSTEM-DESIGNATOR.

      - save-definitions &key seal => <no values> ::
        Write out the current idea about the desire's domain into DEFINITIONS,
        optionally committing changes, when SEAL is non-NIL.
       
      - read-definitions &key (source *self*) (force-source (eq source *self*)) (metastore (meta-path)) => <no values> ::
        Append definitions currently available in METASTORE to the current idea about
        desire's domain.

* Shortcomings

Some known problems:

     - SBCL-only
     - ASDF-only
     - Linux-only (might work on other unices)
     - has a non-trivial amount of CL library dependencies, half of them
       not exactly being common
     - calls out to an obscene amount of external executables, thereby only
       being able to guess about failure reasons

-----

