doc/overview.html

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> Performing knowledge base queries </h3>
<div class="outline-text-3" id="text-7_2">

<dl>
<dt>distributor name &amp;key (if-does-not-exist :error) =&gt; distributor</dt><dd>

</dd>
<dt>remote name &amp;key (if-does-not-exist :error) =&gt; remote</dt><dd>

</dd>
<dt>module name &amp;key (if-does-not-exist :error) =&gt; module</dt><dd>

</dd>
<dt>system name &amp;key (if-does-not-exist :error) =&gt; system</dt><dd>

</dd>
<dt>app name &amp;key (if-does-not-exist :error) =&gt; app</dt><dd>

</dd>
<dt>locality name &amp;key (if-does-not-exist :error) =&gt; locality</dt><dd>

<p>
Find objects by name.
</p>
</dd>
<dt>name object =&gt; symbol</dt><dd>

<p>
Yield object's name.
</p>
</dd>
<dt>url remote-designator &amp;optional module-specifier =&gt; string</dt><dd>

<p>
Compute the URL of a module designated by MODULE-SPECIFIER contained a remote designated by
REMOTE-DESIGNATOR.
</p>
</dd>
<dt>apropos-desr string-designator &amp;optional set-designator =&gt; &lt;no values&gt;</dt><dd>

<p>
Like APROPOS, but finds objects from the domain of desire.
</p>
</dd>
<dt>apropos-desr-list string-designator &amp;optional set-designator =&gt; desirables</dt><dd>

<p>
Like APROPOS-LIST, but finds objects from the domain of desire.
</p>
</dd>
<dt>list-modules =&gt; &lt;no values&gt;</dt><dd>

<p>
List all known modules, with some additional information.
</p>
</dd>
<dt>module-hidden-p module-designator &amp;optional (locality (gate <code>*self*</code>)) =&gt; boolean</dt><dd>

<p>
See whether whether module designated by MODULE-DESIGNATOR is unavailable to anonymous remote clients.
</p>
</dd>
<dt>module-present-p module-designator &amp;optional (locality (gate <code>*self*</code>)) check-when-present-p (check-when-missing-p t) =&gt; boolean</dt><dd>

<p>
Determine whether module designated by MODULE-DESIGNATOR is present in LOCALITY, which defaults
to the local gate locality.
</p>
</dd>
<dt>local-summary &amp;optional (stream <code>*standard-output*</code>) =&gt; &lt;no values&gt;</dt><dd>

<p>
Print a summary about modules within the local gate to STREAM.
</p>
</dd>
<dt>module-best-remote module-designator &amp;key (if-does-not-exist :error) =&gt; remote</dt><dd>

<p>
Produce the remote, if any, which will be chosen to satisfy desires for module
designated by MODULE-DESIGNATOR.
</p>
</dd>
<dt>module-best-distributor module-designator &amp;key (if-does-not-exist :error) =&gt; remote</dt><dd>

<p>
Produce the distributor, if any, whose remote will be chosen to satisfy desires
for module designated by MODULE-DESIGNATOR.
</p>
</dd>
<dt>module-fetch-url module &amp;key allow-self =&gt; string</dt><dd>

<p>
Return the URL which is to be used while fetching MODULE, that is the location of MODULE in the preferred remote.
When ALLOW-SELF is specified, and non-NIL, remotes within <code>*SELF*</code> are not discarded from consideration.
</p>
</dd>
<dt>touch-module module =&gt; boolean, string</dt><dd>

<p>
Try 'access' MODULE via its preferred remote and return whether the attempt was successful as the primary value,
and the output of the toucher executable as the secondary value.
</p>
</dd>
<dt>system-loadable-p system-designator &amp;optional (locality (gate <code>*self*</code>)) =&gt; generalised-boolean</dt><dd>

<p>
Determine whether system designated by SYSTEM-DESIGNATOR is loadable in LOCALITY, which defaults
to the local gate locality.
</p></dd>
</dl>


</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3">7.3</span> Making wishes </h3>
<div class="outline-text-3" id="text-7_3">


<dl>
<dt>desire module-name-or-names =&gt; boolean</dt><dd>

<p>
Make modules with MODULE-NAME-OR-NAMES locally available.
</p>
</dd>
<dt>add-module url &amp;key module-name systemlessp (system-type desr:*default-system-type*) obtain =&gt; module</dt><dd>

<p>
Define a new module, with download location specified by URL, and the module's name
either deduced from the URL, or provided via MODULE-NAME.
</p>
<p>
When OBTAIN is non-NIL, the module is fetched after its definition is internalised.
</p>
</dd>
<dt>update module-designator &amp;optional (locality (gate <b>self</b>)) =&gt; &lt;no values&gt;</dt><dd>

<p>
Update a module specified by MODULE-DESIGNATOR, possibly specifying the target LOCALITY.
</p>
</dd>
<dt>make-module-unpublished module-designator &amp;optional (locality (gate <code>*self*</code>))</dt><dd>

<p>
Stop advertising MODULE in DEFINITIONS, without completely hiding it.
If it is hidden, unhide it.
</p>
</dd>
<dt>hide-module module-designator &amp;optional (locality (gate <code>*self*</code>))</dt><dd>

<p>
Stop advertising MODULE in DEFINITIONS, as well as make it inaccessible
to general public through LOCALITY.
</p>
</dd>
<dt><code>*fetch-errors-serious*</code> =&gt; boolean</dt><dd>

<p>
Whether to raise an error when external executables fail to fetch modules during DESIRE or UPDATE.
Defaults to NIL.
</p>
</dd>
<dt><code>*follow-upstream*</code> =&gt; boolean</dt><dd>

<p>
Whether tracking upstream should update HEAD.
Defaults to T.
</p>
</dd>
<dt><code>*dirty-repository-behaviour*</code> =&gt; keyword</dt><dd>

<p>
Whenever a dirty repository comes up in a situation which requires
a clean one to proceed, do accordingly to the value of this variable:
</p><ul>
<li>
:RESET  -  reset the dirty repository, losing unsaved changes,
</li>
<li>
:STASH  -  reset the dirty repository, stashing unsaved changes,
</li>
<li>
:ERROR  -  raise an error.
</li>
</ul>
</dd>
</dl>

<p>Defaults to :RESET.
</p>

</div>

<div id="outline-container-7_3_1" class="outline-4">
<h4 id="sec-7_3_1"><span class="section-number-4">7.3.1</span> Reader macros for add-module </h4>
<div class="outline-text-4" id="text-7_3_1">


<p>
Following reader macro is enabled by install-add-module-reader:
</p>
<pre class="example">
#@"u://r.l"
#@("u://r.l" &amp;key name obtain)
</pre>


</div>
</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3">7.4</span> Less frequently used functions </h3>
<div class="outline-text-3" id="text-7_4">


<dl>
<dt>system-definition system repository-path &amp;key (if-does-not-exist :error) =&gt; pathname</dt><dd>

<p>
Return the pathname of the SYSTEM's definition.
</p>
</dd>
<dt>clear-definitions =&gt; &lt;no values&gt;</dt><dd>

<p>
Forget everything. A subsequent READ-DEFINITIONS will be instrumental to continue any productive use.
</p>
</dd>
<dt>remove-remote remote-designator &amp;key keep-modules =&gt; nil</dt><dd>

<p>
Forget everything associated with a remote specified by REMOTE-DESIGNATOR, optionally, when KEEP-MODULES
is non-NIL, keeping modules referred by it.
</p>
</dd>
<dt>remove-module module-designator &amp;key keep-localities =&gt; nil</dt><dd>

<p>
Forget everything associated with module specified by MODULE-DESIGNATOR, including
its systems and applications.
</p>
</dd>
<dt>remove-system system-designator =&gt; nil</dt><dd>

<p>
Forget everything associated with the system specified by SYSTEM-DESIGNATOR.
</p>
</dd>
<dt>save-definitions &amp;key seal =&gt; &lt;no values&gt;</dt><dd>

<p>
Write out the current idea about the desire's domain into DEFINITIONS,
optionally committing changes, when SEAL is non-NIL.
</p>
</dd>
<dt>read-definitions &amp;key (source <b>self</b>) (force-source (eq source <b>self</b>)) (metastore (meta-path)) =&gt; &lt;no values&gt;</dt><dd>

<p>
Append definitions currently available in METASTORE to the current idea about
desire's domain.
</p></dd>
</dl>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Shortcomings </h2>
<div class="outline-text-2" id="text-8">


<p>
Some known problems:
</p>
<ul>
<li>
SBCL-only
</li>
<li>
ASDF-only
</li>
<li>
Linux-only (might work on other unices)
</li>
<li>
has a non-trivial amount of CL library dependencies, half of them
not exactly being common
</li>
<li>
calls out to an obscene amount of external executables, thereby only
being able to guess about failure reasons
</li>
</ul>



<hr/>
















</div>
</div>
