doc/overview.org
* Footnotes

[fn:1] Actually, sometimes a group of domain names, like in case of sourceforge.

[fn:2] Currently supported release mechanisms are: git, darcs, cvs, svn and tarballs.
Additionally, this is extended by some transport variety, like, for example, rsync.

[fn:3] The term is borrowed from the git terminology.

[fn:4] In git this is accomplished by ensuring that the relevant repository lacks
a .git/git-daemon-export-ok file.

[fn:5] Currently, the only backend system implemented is ASDF.

[fn:6] Recovering such hidden systems complicates construction of full dependency graph in case of ASDF.

[fn:7] This is tied to the concept of well known release locations and differs
from the set of modules converted and reexported in the wishmaster
process.

[fn:8] Available through git://github.com/purcell/darcs-to-git.git/

[fn:9] As per MODULE-LOCALLY-PRESENT-P.

[fn:10] Three of them: full information, incremental and an ASDF-INSTALL-like post-factum one.

[fn:11] Git-centric.

[fn:12] Intermittent availability only, as of now.

[fn:13] It's a heuristic, if you are curious, but it works pretty well.
