doc/overview.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> Git-centric.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> Three of them: full information, incremental and an ASDF-INSTALL-like post-factum one.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.3" href="#fnr.3">3</a></sup> It's a heuristic, if you are curious, but it works pretty well.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.4" href="#fnr.4">4</a></sup> Intermittent availability only, as of now.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.5" href="#fnr.5">5</a></sup> This is tied to the concept of well known release locations and differs
from the set of modules converted and reexported in the wishmaster
process.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.6" href="#fnr.6">6</a></sup> Available through git://github.com/purcell/darcs-to-git.git/
</p>
<p class="footnote"><sup><a class="footnum" name="fn.7" href="#fnr.7">7</a></sup> Actually, sometimes a group of domain names, like in case of sourceforge.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.8" href="#fnr.8">8</a></sup> Currently supported release mechanisms are: git, darcs, cvs, svn and tarballs.
Additionally, this is extended by some transport variety, like, for example, rsync.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.9" href="#fnr.9">9</a></sup> The term is borrowed from the git terminology.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.10" href="#fnr.10">10</a></sup> As per MODULE-LOCALLY-PRESENT-P.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.11" href="#fnr.11">11</a></sup> In git this is accomplished by ensuring that the relevant repository lacks
a .git/git-daemon-export-ok file.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.12" href="#fnr.12">12</a></sup> Currently, the only backend system implemented is ASDF.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.13" href="#fnr.13">13</a></sup> Recovering such hidden systems complicates construction of full dependency graph in case of ASDF.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Samium Gromoff
</p>
<p class="date"> Date: 2011-01-27 15:07:31 MSK</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
